Revit 2027 API
MacroManagerIterator.IsDone Method
 Identifies if the iteration has completed.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool IsDone()
Public Overridable Function IsDone As Boolean
public:
virtual bool IsDone()
abstract IsDone : unit -> bool
override IsDone : unit -> bool
Return Value
Boolean
 True if the iteration has no more items. False if there are more items to be iterated.
See Also
Reference
MacroManagerIterator Class
Autodesk.Revit.DB.Macros Namespace